Revit 2026 API

# BuiltInFailuresHvacFailures Class

---

Failures related to HVAC in MEP.

SystemObject Autodesk.Revit.DBBuiltInFailuresHvacFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class HvacFailures
```
```vb
Public NotInheritable Class HvacFailures
```
```cpp
public ref class HvacFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type HvacFailures = class end
```

The BuiltInFailuresHvacFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PanelDoesntMatchCircuitPropertiesDisconnected | The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit? |

#### Reference

Autodesk.Revit.DB Namespace